In [1]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
from config import db_password
from flask import Flask
from flask_sqlalchemy import sqlalchemy
import os
import re
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

path= 'Resources/'

In [2]:
db_string = f"postgres://postgres:{db_password}@127.0.0.1:5432/team3"
engine = create_engine(db_string)

In [3]:
obj = pd.read_csv(path+'objects_clean.csv', index_col=0)
obj.head()

C:\Users\phsstudent\anaconda3\envs\mlenv\lib\site-packages\IPython\core\interactiveshell.py:3072: DtypeWarning: Columns (3,5,7,8,9,10,11,13,14,17,18) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

  object_id entity_type parent_id                name    category_code     status  founded_at closed_at country_code state_code         city       region first_investment_at last_investment_at  investment_rounds  invested_companies first_funding_at last_funding_at  funding_rounds  funding_total_usd first_milestone_at last_milestone_at  milestones  relationships
0       c:1     Company       NaN            Wetpaint              web  operating  2005-10-17       NaN          USA         WA      Seattle      Seattle                 NaN                NaN                  0                   0       2005-10-01      2008-05-19               3         39750000.0         2010-09-05        2013-09-18           5             17
1      c:10     Company       NaN             Flektor      games_video   acquired         NaN       NaN          USA         CA  Culver City  Los Angeles                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              6
2     c:100     Company       NaN               There      games_video   acquired         NaN       NaN          USA         CA    San Mateo       SF Bay                 NaN                NaN                  0                   0              NaN             NaN               0                0.0         2003-02-01        2011-09-23           4             12
3   c:10000     Company       NaN             MYWEBBO  network_hosting  operating  2008-07-26       NaN          NaN        NaN          NaN      unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0
4   c:10001     Company       NaN  THE Movie Streamer      games_video  operating  2008-07-26       NaN          NaN        NaN          NaN      unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0

In [4]:
obj[obj['object_id'].str.contains('p:', regex=True)]

       object_id entity_type parent_id                    name category_code     status founded_at closed_at country_code state_code city   region first_investment_at last_investment_at  investment_rounds  invested_companies first_funding_at last_funding_at  funding_rounds  funding_total_usd first_milestone_at last_milestone_at  milestones  relationships
208205      p:10      Person       NaN         Mark Zuckerberg           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0         2007-01-01        2013-12-04           5              2
208206     p:100      Person       NaN            Peter Lester           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1
208207    p:1000      Person       NaN  Dr. Steven E. Saunders           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1
208208   p:10000      Person       NaN              Neil Capel           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              6
208209  p:100000      Person       NaN              Sue Pilsch           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1
...          ...         ...       ...                     ...           ...        ...        ...       ...          ...        ...  ...      ...                 ...                ...                ...                 ...              ...             ...             ...                ...                ...               ...         ...            ...
434908   p:99995      Person       NaN               Sue Gench           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1
434909   p:99996      Person       NaN         Rick Tamberrino           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0
434910   p:99997      Person       NaN           Peter Lalonde           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              7
434911   p:99998      Person       NaN            Adam Neumann           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              2
434912   p:99999      Person       NaN           Ramon Peypoch           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0

[226708 rows x 24 columns]

In [5]:
ppl = pd.read_csv(path+'people_cleaner.csv', index_col=0)
ppl

       object_id first_name last_name affiliation_name
0            p:2        Ben   Elowitz        Blue Nile
1            p:3      Kevin  Flaherty         Wetpaint
2            p:4       Raju   Vegesna             Zoho
3            p:5        Ian     Wenig             Zoho
4            p:6      Kevin      Rose     i/o Ventures
...          ...        ...       ...              ...
226703  p:268587       Mark   Stolper     Unaffiliated
226704  p:268589       John      Pins     Unaffiliated
226705  p:268590      David  Schulhof     Unaffiliated
226706  p:268592    Matthew  D. Rosen     Unaffiliated
226707  p:268593     Gordon  Hutchins     Unaffiliated

[226708 rows x 4 columns]

In [6]:
ppl.object_id.nunique()

226708

In [33]:
degrees = pd.read_csv(path +'degrees_clean.csv', index_col=0)
degrees

       object_id degree_type                       subject                                        institution graduated_at
0         p:6117         MBA                           NaN                                                NaN          NaN
1         p:6136          BA               English, French                   Washington University, St. Louis     1/1/1990
2         p:6136          MS            Mass Communication                                  Boston University     1/1/1992
3         p:6005          MS           Internet Technology                            University of Greenwich     1/1/2006
4         p:5832         BCS  Computer Science, Psychology                                    Rice University          NaN
...          ...         ...                           ...                                                ...          ...
109605  p:268589         CPA                           NaN  American Institute of Certtified Public Accoun...          NaN
109606  p:268527     MS & BS                   Engineering               South China University of Technology          NaN
109607  p:268527         PhD                   Engineering                                Clarkson University          NaN
109608  p:268528        B.S.        Electrical Engineering                          Colorado State University          NaN
109609  p:268528        J.D.                           NaN              University of San Diego School of Law          NaN

[109056 rows x 5 columns]

In [34]:
degrees[degrees['object_id']=='p:6']

      object_id degree_type subject                      institution graduated_at
15623       p:6         NaN     NaN  University of Nevada, Las Vegas          NaN
69508       p:6         NaN     NaN                       Montessori     1/1/1983

In [35]:
deg = degrees
#deg['degree_type']=[x for x in deg['degree_type'] if str(x) != 'nan']

deg[deg['degree_type']!='NaN']

       object_id degree_type                       subject                                        institution graduated_at
0         p:6117         MBA                           NaN                                                NaN          NaN
1         p:6136          BA               English, French                   Washington University, St. Louis     1/1/1990
2         p:6136          MS            Mass Communication                                  Boston University     1/1/1992
3         p:6005          MS           Internet Technology                            University of Greenwich     1/1/2006
4         p:5832         BCS  Computer Science, Psychology                                    Rice University          NaN
...          ...         ...                           ...                                                ...          ...
109605  p:268589         CPA                           NaN  American Institute of Certtified Public Accoun...          NaN
109606  p:268527     MS & BS                   Engineering               South China University of Technology          NaN
109607  p:268527         PhD                   Engineering                                Clarkson University          NaN
109608  p:268528        B.S.        Electrical Engineering                          Colorado State University          NaN
109609  p:268528        J.D.                           NaN              University of San Diego School of Law          NaN

[109056 rows x 5 columns]

In [36]:
deg

       object_id degree_type                       subject                                        institution graduated_at
0         p:6117         MBA                           NaN                                                NaN          NaN
1         p:6136          BA               English, French                   Washington University, St. Louis     1/1/1990
2         p:6136          MS            Mass Communication                                  Boston University     1/1/1992
3         p:6005          MS           Internet Technology                            University of Greenwich     1/1/2006
4         p:5832         BCS  Computer Science, Psychology                                    Rice University          NaN
...          ...         ...                           ...                                                ...          ...
109605  p:268589         CPA                           NaN  American Institute of Certtified Public Accoun...          NaN
109606  p:268527     MS & BS                   Engineering               South China University of Technology          NaN
109607  p:268527         PhD                   Engineering                                Clarkson University          NaN
109608  p:268528        B.S.        Electrical Engineering                          Colorado State University          NaN
109609  p:268528        J.D.                           NaN              University of San Diego School of Law          NaN

[109056 rows x 5 columns]

In [41]:
counts = degrees.degree_type.value_counts()
counts_df = pd.DataFrame(counts)
counts_df.to_csv('deg_counts.csv')

In [45]:
deg_conv = {'Foundation':0,'Bio-Medical Engineering':1, 'Electrical Engineering':2, 'BTECH':2, 'BASC':2, 
            'Sc. B.':2, 'BA':2, 'BS':2, 'B.S.':2, 'S.B':2, 'AA':1, 'Certificate of Management of Tec':1 , 
            'college degree':1, 'BBA':2, 'Propedeuse':0, 'BS': 2, 'BFA':2, 'BE':2,'BA': 2, 'BCS':2, 
            'HEC':2, 'Kaufmannsgehilfenbrief':2, 'Dipl.-Kfm.':2, 'HBSc, Economics':2,'CPA': 3, 'MIAGE':3, 
            'Master of Retail Management':3,'Joint B.A./M.A.':3,'BA/MA':3, 'MBA':4, 'MBA/MA':4, 'MS':3, 
            'MA':3, 'MPA':3, 'MS.M':3, 'MBA With Honors':3, 'M.Eng & BS':3, 'M.Math':3, 'LLB':4, 'LLM':4, 
            'Masters and Ph.D.':5, 'JD':4, 'J.D.':4, 'PhD':5, 'DS':5, 'nan':0, 'JD/MBA':4, 
            'B. Commerce':2, 'European Economics, European Law':4,'CEMS Master':3, 'BCOM':2,'Undergrad':2,
            'Management Development for Entre':2,'Industrial Design':2,'Degree':1, 'Undergraduate degree':2,
            'Post-graduate diploma':3,'First class honours degree':2,'Business Administration':3, 'MSE':3, 
            'CSS':3, 'Bachelor of Commerce (Honors) Gr':2, 'BA/BSc':2,'ScB':2,'SB':2, 'Bachelors of Mathematics':2, 
            'Master of Mathematics':3, 'Doctor of Philosophy':5,'Bachelor of Electrical Engineeri':2, 
            'BS, MS':3, 'MENG':3, 'Ph.D. Candidate':4,'B.S./B.A.':2,'BBS':2, 'AS':1,'B.S.Eng.':1,
            'MSc, Mathematics (Highest Honors':3,'Communication Designer':1, 'EEM':3, 'BA hons 2:1':1, 'MS, BS':3,
            'CollÃ¨ge':0, 'Master Degree':3, 'MEA':3, 'Bachelor of Fine Arts':2, 'Masters Degree in Marketing Mana':3,
            'AB, Magna Cum Laude':2, 'Bachelors in Engineering':2, 'B.A. - High Honors':2, 'M.A , C. Phil.':3,
            'Applied Science (Computer Scienc':1, 'BSc Hons First class':2,'M.M.':3, 'Professional':4,
            'DIPLOMA IN ENGINEERING':2, 'Bachelor of Science in Economics':1,'B.S. Business Administration (Fi':2, 
            'B.A. International Relations (Gl':2, 'B.S. International Political Eco':2, 'Master of Laws':4, 
            'MS with Honors':3, 'Bachelor Arts':2, 'Bachleor of Science':2, 'Post Graduate Degree':3.5, 
            'Postgraduate':3.5, 'S.M. (masters)':3,'BIS':2, 'BA (na)':2, 'A.M.':1,'Bachelor of Law':2, 
            "Master's in International Manage":3,  'J.D. (cum laude)':4,'B.S.F.S.':2, 'BA (Hons) In-Company Degree':2,
            'Mater Of computers Applications':3, 'ABD':2, 'MBA, BS':3,'BSME':2, 'MSME':3, 
            'B.S. in Computer Science':2, 'A.A. in Accounting and a B.S. in':2, 'M.Sc Information Technology':3, 
            'M. Sc. in Computer Science':3, 'Entrepreneurial Masters Program':3, 'BA, cum laude':2,'B.A./M.A.':3, 
            'Bachlor':2, 'B. Business':2, 'B. Engineering':2, 'PhD Computer Science':5, 'MA First Class Honours':3, 
            'Master of Econ.':3, 'M.C.A':3, 'BAI':2, 'MPS':3, 'Manager of Economy':3, 'BSN':2, 'Ed.M.':3, 
            'Master of Urban Planning':3, 'Postgraduate Diploma':3, 'Dual Bachelor of Fine Arts':2, 'MD-PhD':5,'MCA':3,
            'BC':2, 'MPH':3, 'MSW':3, 'AM':1,  'Baccalaureat':2,'M.S.E.':2, 'BA in Economics':2, 'MSc (Econ)':3, 
            'Masterâ\x80\x99s Degree in Business Ad':3, 'Associate of Science':1, 'Bacholer of Science':2, 
            'Bachelor of Journalism':2,'B.Eng. Minor in Business marketi':2, 'B.S. Electrical Engineering':2, 
            'Diplom-Kaufman':2, 'Maitrise  Gestion (MBA)':4, "Post Master's degree - Ph.D. pro":4, 'B of A':2, 
            'Bachelor of Design':2, 'Engineering Degree':2, 'Specialized Master':3, 'Bachelor of Science in Business':2, 
            'BA with Honors':2, 'MA (Honours)':3, 'B.S. Computer Science':2, 'MBA, MA Education':4, 'BA Journalism':2, 
            'MSc. in Computer Science':3, 'A. B. summa cum laude':2, 'BS in CS':2, 'Bachelors of Commerce':2,
            'BBA (CAM)':2, 'Bachilor':2, 'Msc (Distinction)':3, 'Law':4, 'Master of Engineering':3,'MPHYS':3,  
            'Bachelor of Science (BS)':2, 'BSc Honours':2, 'BA Computer Science':2, 'MEng, MA':3, 'D. Phil':5,
            'MED':4, 'Bach. of Engg.':2, 'Associates of Sciences':1, 'Bachelors in Business & IT':2, 'M.A.Sc.':3, 
            'JD, MBA':4, 'Bachelor of Information Technolo':2,'BcA':2, 'MA (Hons)':3, 'BA Business':2, 'AAS':1,
            'MBA (Coporate Finance)':4, 'B.S. Business Administration':2,'Abogado / Attorney':4, 'B. Engg.':2, 
            'Bachelor of Science in Engineeri':2, 'Master of Educational Technology':3, 
            'Master of Educational Technology':3,'MBA-FM':3,'Masters Psychology':3, 
            'B.S. Computer Information System':2, 'B.A. with honors':2, 'Bachelor of Technology (B.Tech)':2,
            'BE/BS (Engineering)':2, 'B.S. Computer Engineering':2, 'BA - Business Management':2, 
            'Master Grande Ecole':3, 'JBA':2, 'Bsc (Eng) (Elec)':2, 'D.Phil':5, 'Bachelor Science':2, 
            'BFA, Communication Arts emphasis':2, 'MFC':3,'BS Economics':2, 'BS/MS':3, 'Bachelors of Technology':2, 
            'M.Sc. in Information Systems':3, 'doctoral degree':5, 'Bachelor of Science degree':2, 'Sc.B':2,
            'MSc, BSc':3, 'B.A. cum laude':2, 'graduated':1, 'BA, BE, and MBA':4, "Master's Degree and Doctorate":5, 
            'LL.M, LL.B,B.A':4, 'ME':3, 'Bachelors of Scienc':2, 'degree':1,'Bachelor of Social Science':2, 
            'MSc and DPhil':5, 'MSci':3, 'MS in Electrical Engineering':3, 'Bachelor of Business Studies':2, 
            'B.S. in mechanical engineering':2, 'B.S. in business administration':2,
            'M.B.A. in finance and marketing':3, 'BSE, MSE':3, 'BCP':2, 'Master of Architecture':3, 
            'BSc Engineering':2, 'Masters in Computer Science':3, 'MBA and a CFA':3, 'Business degree':2, 
            'Bachelor of Economics':2, 'ScD':5,"Master's and Bachelor's Degrees":3, 'MS and BS':3, 
            'Bachleor of Arts':2,'M.D. and Ph.D.':5,  'Masters of arts':3,  "Master's degrees":3, 
            'Bachelorâ\x80\x99s degree':2, 'MBA & JD':4,'Bachelor and a Doctorate degree':5,
            'Master of Information Technology':3, 'Advanced Masters degree in Compu':3, 
            'Bachelors Degree in computer Sci':2,'M.A. and M.B.A.':3, 'Doctorate of Science':5, 'MS and PhD':5, 
            'Ph.D. and M.Sc.':5, 'Ph.D. and D.I.C.':5, 'MBA and BBA':4, 'B.B.A. and a M.B.A.':4,'Bsc Computer Science':2, 
            'Bachelor of Sciences (Agricultur':2,'BS/BA':2, 'BS and PHD':5, 'Dr.':5, 'BS, Engineering':2,
            'BS, Engineering':2, 'Ph.D. and M.S.':5, 'CFA':3 }
# traversing through dataframe 
# Gender column and writing 
# values where key matches 
#data.Gender = [gender[item] for item in data.Gender] 
#print(data) 
deg.degree_type = [deg_conv.get(item)
        for item in deg.degree_type
]
deg

       object_id  degree_type                       subject                                        institution graduated_at
0         p:6117          4.0                           NaN                                                NaN          NaN
1         p:6136          2.0               English, French                   Washington University, St. Louis     1/1/1990
2         p:6136          3.0            Mass Communication                                  Boston University     1/1/1992
3         p:6005          3.0           Internet Technology                            University of Greenwich     1/1/2006
4         p:5832          2.0  Computer Science, Psychology                                    Rice University          NaN
...          ...          ...                           ...                                                ...          ...
109605  p:268589          3.0                           NaN  American Institute of Certtified Public Accoun...          NaN
109606  p:268527          NaN                   Engineering               South China University of Technology          NaN
109607  p:268527          5.0                   Engineering                                Clarkson University          NaN
109608  p:268528          2.0        Electrical Engineering                          Colorado State University          NaN
109609  p:268528          4.0                           NaN              University of San Diego School of Law          NaN

[109056 rows x 5 columns]

In [58]:
# Getting highest degree, post degree valuation.
deg_test = deg.groupby(deg['object_id']).max()
deg_test = deg_test.reset_index()
deg_test

      object_id  degree_type                            subject                           institution graduated_at
0          p:10          NaN                   Computer Science                    Harvard University         None
1      p:100006          4.0               Strategy & Marketing        MIT Sloan School of Management     1/1/2004
2      p:100013          4.0                 Physical Chemistry                  University of Mumbai         None
3      p:100018          4.0                  Marketing, French  University of Maryland, College Park     1/1/2004
4      p:100031          2.0  Information Science & Engineering         Gogte Institute of Technology     1/1/2010
...         ...          ...                                ...                                   ...          ...
68066   p:99983          NaN                                NaN              University of Washington          NaN
68067   p:99988          2.0         Maths and Computer Science                    Bristol University     1/1/2004
68068   p:99990          NaN                               None                              Technion     1/1/1971
68069   p:99994          2.0                                 MS           University of Madras, India         None
68070   p:99997          2.0                          Economics                  University of Ottawa     1/1/1993

[68071 rows x 5 columns]

In [56]:
deg_test[deg_test['object_id']=='p:6136']

      object_id  degree_type             subject                       institution graduated_at
59154    p:6136          3.0  Mass Communication  Washington University, St. Louis     1/1/1992

In [64]:
deg_test=='NaN'

C:\Users\phsstudent\anaconda3\envs\mlenv\lib\site-packages\pandas\core\ops\array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

       object_id  degree_type  subject  institution  graduated_at
0          False        False    False        False         False
1          False        False    False        False         False
2          False        False    False        False         False
3          False        False    False        False         False
4          False        False    False        False         False
...          ...          ...      ...          ...           ...
68066      False        False    False        False         False
68067      False        False    False        False         False
68068      False        False    False        False         False
68069      False        False    False        False         False
68070      False        False    False        False         False

[68071 rows x 5 columns]

In [65]:
deg_test.degree_type.isnull().value_counts()

False    55672
True     12399
Name: degree_type, dtype: int64